{
  "LBL0000": "MUD APPLICATION",
  "LBL0001": "Hello.",
  "LBL0002": "I'm {0}",
  "LBL0003": "Data Binding Demo",
  "LBL0004": "Me",
  "LBL0005": "History",
  "LBL0006": "Home",
  "LBL0007": "Counter",
  "LBL0008": "Weather",
  "LBL0009": "Table",
  "LBL0010": "Chart",
  "LBL0011": "Settings",
  "LBL0012": "Users",
  "LBL0013": "Security",
  "LBL0014": "Name",
  "LBL0015": "Birth",
  "LBL0016": "Gender",
  "LBL0017": "Email",
  "LBL0018": "한국어",
  "LBL0019": "English",
  "LBL0020": "ADD",
  "LBL0021": "REMOVE",
  "LBL0022": "MODIFY",
  "LBL0023": "I am part of the iPlus development team, working on WinForms and Sybase development. iPlus is an ERP product tailored for mid-sized and small businesses, and I am responsible for the HR and logistics modules. My work is based on C# and .NET Framework 2.0 to 3.5, and I also use the Firebird database. Additionally, I have developed menus for electronic tax invoices and company management on the Android Gingerbread platform. I have experience with other databases as well, including MSSQL, Oracle, and PostgreSQL.",
  "LBL0024": "Worked at a virtualization development company for 6 months and developed an administrator console. Based on WinForms, we created a console that communicates with the server side to create and manage VMs through a hypervisor. At the same time, a hypervisor daemon service application running on Red Hat Linux was created. During this period, I was able to learn about VM creation and networks. The structure is simpler than you think. The main function is to create a user's VM through communication between the administrator console, main server, and hypervisor server. The deamon service application installed on the hypervisor server creates VMs according to the main server's request. This was the opportunity to learn about thrift and GRPC.",
  "LBL0025": "As a subsidiary of SK, he was mainly in charge of SI and solution development. SI participated in the development of SK Holdings' contribution system and developed and delivered it alone. The order amount was 1 billion, which became an opportunity for the department to participate in the 10 billion won project. I worked with Winform and MSSQL as a CS environment. At this time, we tried to use various techniques, and we developed them using the TransactionScope and service-repository patterns for transaction management. Until this time, Winform lacked async and await functions, so I worked on the UI with synchronization. It was developed using DB MAPPER, which I developed personally, and then moved on to Dapper. I found that Dapper is fast in caching for the data model. As a solution, the company maintained a Delphi-based chat solution and developed a screen recording program. The program continued to develop a free version under the name Open Recorder. In addition, he tried to develop a framework for web development, but he could not develop it due to personal reasons and dropped out.",
  "LBL0026": "He participated in the development of movies and tickets in the Entertainment Division. Maintained and developed web form and Flash-based sites. Specific discount events were automated, and seat maps and reservation linkage were mainly developed. Due to the Flash issue, the administrator was reorganized, and the movie site was also reorganized. All were based on MVC. In order to improve the user experience and increase the convenience of development when reorganizing the movie site, all the reservation parts were worked in a partial view, and each view was worked in a hidden way to give an effect similar to that of a SPA. We used cookies and browser memory DB. The reservation part was drastically changed, and the factory pattern was used to separate them into interests by booking destination and theater, and efforts were made to delete the existing if-else code. In addition, the existing communication server of the theater company was separated separately due to management issues, but it was merged into the site project for management. At this time, I also felt a lot, but development is something that can never be done alone.",
  "LBL0027": "It is a company that develops SasS-type ERP products. It is a company that maintains a very high level of technology, and although there is a very big problem with its deviation, it is a company that has learned a lot and worked with a lot of fun. Technically, it's very interesting, it's basically MVC, but it keeps the browser behavior close to the SPA, and it has developed and uses its own back-end and front-end frameworks. The backend is a complete revamp of the MVC framework and uses a lot of optimization techniques. It has also developed and is using its own ORM. This ORM is really interesting, because it's actually a procedure generator and also uses a query cache, so you don't get an error even if you're looking at different caches in the same operating environment. In addition, it operates a system that is close to virtually unlimited distribution, and there are signs that a lot of thought has been put into creating such a system. It really helped me a lot with backend development. Front-end development is also very interesting, it is basically based on jQuery, but at the same time, it has a dynamic screen generation engine using JavaScript components. What this means is that you can customize the screen, store that data in the DB, and dynamically generate the screen DOM and attach it to the View each time you call it. Therefore, the load is very large and the workload is considerable. As a result, it was very cache-heavy and spent a lot of money on optimizations to improve speed. In addition, he is developing various automation apps and solutions, and he personally developed an ECOUNT recording program using his experience in screen recording program development to develop a program that allows users to visually view user errors. It existed before, but it was spending about 10 million won on maintenance costs, so it would have helped to save on licensing costs.",
  "LBL0028": "At present, he has forgotten all his old aspirations and is wandering between his wriggling desires while trying to become an ordinary office worker in the countryside. There are only two people I remember from going through various companies: Mr. Park at Yes24 and Mr. Choi at ECOUNT. I had aspirations to become this kind of person, but now I have given up a lot. I have health problems and want to work slowly for the time being.",
  "LBL0029": "Welcome",
  "LBL0030": "Recent Work",
  "LBL0031": "Current",
  "LBL0032": "My Secrets Diary",
  "LBL0033": "AGL homepage development", 
  "LBL0034": "AGL sales page management site development", 
  "LBL0035": "Screen recording program development", 
  "LBL0036": "Movie and ticket site development", 
  "LBL0037": "SaaS ERP development", 
  "LBL0038": "Open-source development",
  "LBL0039": "List",
  "LBL0040": "New",
  "LBL0041": "Save",
  "LBL0042": "Hello. Anything you type here is currently only stored in your browser and is not shared. All content is stored encrypted so that no one else can see it.",
  "LBL0043": "Search",
  "LBL0044": "Music"
}